[
    {
      "word": "ability",
      "definition": "/əˈbɪləti/ (BrE) /əˈbɪləti/ (AmE)\n\n1. [noun] Ability: The quality or state of being able to do something.\n- 中文释义：能够完成某事的能力或状态。\n\n2. [noun] Skill: A natural talent or acquired proficiency in a particular area.\n- 中文释义：在某一特定领域的天赋或熟练程度。\n\n例句：\n- She has the ability to solve complex problems quickly. （她有能力快速解决复杂问题。）\n- His artistic abilities were evident from a young age. （他从小便展现出艺术天赋。）"
    },
    {
      "word": "absorb",
      "definition": "/əbˈsɔːb/ (BrE) /əbˈsɔːrb/ (AmE)\n\n1. [verb] Absorb: To take in or soak up a liquid, substance, or energy.\n- 中文释义：吸收液体、物质或能量。\n\n2. [verb] Engross: To occupy oneself deeply with something.\n- 中文释义：全神贯注于某事。\n\n例句：\n- Plants absorb carbon dioxide from the air. （植物从空气中吸收二氧化碳。）\n- He was so absorbed in his book that he didn't hear the doorbell. （他完全沉浸在书中，以至于没听见门铃声。）"
    },
    {
      "word": "account",
      "definition": "/əˈkaʊnt/ (BrE) /əˈkaʊnt/ (AmE)\n\n1. [noun] Account: A report or description of an event or experience.\n- 中文释义：对事件或经历的描述或报告。\n\n2. [noun] Record: A formal banking arrangement for managing money.\n- 中文释义：管理资金的正式银行账户。\n\n例句：\n- She gave a detailed account of her trip to Japan. （她详细描述了她的日本之行。）\n- I need to check my bank account balance. （我需要检查我的银行账户余额。）"
    },
    {
      "word": "adjust",
      "definition": "/əˈdʒʌst/ (BrE) /əˈdʒʌst/ (AmE)\n\n1. [verb] Adjust: To change slightly to make something fit or work better.\n- 中文释义：稍微改变以使某物更适合或更好运作。\n\n2. [verb] Adapt: To become accustomed to new conditions.\n- 中文释义：适应新环境或条件。\n\n例句：\n- You may need to adjust the settings on your camera. （你可能需要调整相机的设置。）\n- It took him a while to adjust to the new job. （他花了一段时间才适应新工作。）"
    },
    {
      "word": "balance",
      "definition": "/ˈbæləns/ (BrE) /ˈbæləns/ (AmE)\n\n1. [noun] Balance: A state of equilibrium or stability.\n- 中文释义：平衡或稳定的状态。\n\n2. [verb] Balance: To distribute weight evenly to remain stable.\n- 中文释义：均匀分布重量以保持稳定。\n\n例句：\n- Maintaining a good work-life balance is important. （保持良好的工作与生活平衡很重要。）\n- She balanced the tray carefully as she walked. （她走路时小心翼翼地端平了托盘。）"
    },
    {
      "word": "benefit",
      "definition": "/ˈbenɪfɪt/ (BrE) /ˈbenɪfɪt/ (AmE)\n\n1. [noun] Benefit: An advantage or profit gained from something.\n- 中文释义：从某事物中获得的优势或利益。\n\n2. [verb] Benefit: To be helped or improved by something.\n- 中文释义：因某事物而受益或改善。\n\n例句：\n- Regular exercise has many health benefits. （定期锻炼有许多健康益处。）\n- The new policy will benefit small businesses. （新政策将使小企业受益。）"
    },
    {
      "word": "calculate",
      "definition": "/ˈkælkjuleɪt/ (BrE) /ˈkælkjuleɪt/ (AmE)\n\n1. [verb] Calculate: To determine the amount or number of something mathematically.\n- 中文释义：通过数学方法计算某事物的数量或金额。\n\n2. [verb] Estimate: To plan or predict based on available information.\n- 中文释义：根据可用信息进行计划或预测。\n\n例句：\n- Use a calculator to calculate the total cost. （使用计算器计算总成本。）\n- We need to calculate the risks before making a decision. （我们需要在做决定之前评估风险。）"
    },
    {
      "word": "challenge",
      "definition": "/ˈtʃælɪndʒ/ (BrE) /ˈtʃælɪndʒ/ (AmE)\n\n1. [noun] Challenge: A difficult task or problem that tests someone's abilities.\n- 中文释义：考验某人能力的艰巨任务或问题。\n\n2. [verb] Challenge: To invite someone to compete or argue.\n- 中文释义：邀请某人竞争或争论。\n\n例句：\n- Climbing Mount Everest is a great challenge. （攀登珠穆朗玛峰是一项巨大的挑战。）\n- He challenged me to a game of chess. （他向我挑战下国际象棋。）"
    },
    {
      "word": "communicate",
      "definition": "/kəˈmjuːnɪkeɪt/ (BrE) /kəˈmjuːnɪkeɪt/ (AmE)\n\n1. [verb] Communicate: To share or exchange information with others.\n- 中文释义：与他人分享或交换信息。\n\n2. [verb] Express: To convey thoughts, feelings, or ideas clearly.\n- 中文释义：清晰地表达思想、情感或想法。\n\n例句：\n- Effective communication is key to success in any team. （有效的沟通是任何团队成功的关键。）\n- She communicates well with her colleagues. （她与同事沟通得很好。）"
    },
    {
      "word": "develop",
      "definition": "/dɪˈveləp/ (BrE) /dɪˈveləp/ (AmE)\n\n1. [verb] Develop: To grow or cause something to grow or become more advanced.\n- 中文释义：成长或使某事物成长或变得更先进。\n\n2. [verb] Create: To bring something into existence through effort or planning.\n- 中文释义：通过努力或规划创造某事物。\n\n例句：\n- Children develop rapidly during their early years. （儿童在早期阶段发展迅速。）\n- The company plans to develop new products next year. （公司计划明年开发新产品。）"
    },
    {
      "word": "effort",
      "definition": "/ˈefət/ (BrE) /ˈefərt/ (AmE)\n\n1. [noun] Effort: Physical or mental exertion used to achieve something.\n- 中文释义：为实现某事所付出的体力或脑力劳动。\n\n2. [noun] Attempt: A determined try to accomplish something.\n- 中文释义：为完成某事所做的尝试。\n\n例句：\n- It took a lot of effort to finish the project on time. （按时完成项目需要付出很多努力。）\n- Her efforts were recognized by the team. （她的努力得到了团队的认可。）"
    },
    {
      "word": "feature",
      "definition": "/ˈfiːtʃə/ (BrE) /ˈfiːtʃər/ (AmE)\n\n1. [noun] Feature: A distinctive attribute or aspect of something.\n- 中文释义：某事物的独特属性或方面。\n\n2. [verb] Highlight: To include or emphasize something as important.\n- 中文释义：将某事物作为重点包括或强调。\n\n例句：\n- The phone comes with several new features. （这款手机配备了多项新功能。）\n- The article features interviews with leading experts. （这篇文章重点介绍了对领先专家的采访。）"
    },
    {
      "word": "generate",
      "definition": "/ˈdʒenəreɪt/ (BrE) /ˈdʒenəreɪt/ (AmE)\n\n1. [verb] Generate: To produce or create something, especially energy or ideas.\n- 中文释义：生产或创造某事物，尤其是能源或想法。\n\n2. [verb] Cause: To bring about a particular result or situation.\n- 中文释义：导致某种结果或情况。\n\n例句：\n- The wind turbines generate electricity for the city. （风力涡轮机为城市发电。）\n- Brainstorming sessions can generate creative solutions. （头脑风暴会议可以产生创造性的解决方案。）"
    },
    {
      "word": "highlight",
      "definition": "/ˈhaɪlaɪt/ (BrE) /ˈhaɪlaɪt/ (AmE)\n\n1. [noun] Highlight: The most important or memorable part of something.\n- 中文释义：某事物中最重要的或最令人难忘的部分。\n\n2. [verb] Emphasize: To draw attention to something significant.\n- 中文释义：强调某重要事物以引起注意。\n\n例句：\n- The highlight of the trip was visiting the ancient ruins. （这次旅行的亮点是参观古代遗址。）\n- The report highlights the need for further research. （报告强调了进一步研究的必要性。）"
    },
    {
      "word": "impact",
      "definition": "/ˈɪmpækt/ (BrE) /ˈɪmpækt/ (AmE)\n\n1. [noun] Impact: The effect or influence of one thing on another.\n- 中文释义：一事物对另一事物的影响或作用。\n\n2. [verb] Affect: To have a strong effect on something or someone.\n- 中文释义：对某事物或某人产生强烈影响。\n\n例句：\n- The new law will have a significant impact on the economy. （新法律将对经济产生重大影响。）\n- Climate change is impacting ecosystems worldwide. （气候变化正在影响全球生态系统。）"
    },
    {
        "word": "improve",
        "definition": "/ɪmˈpruːv/ (BrE) /ɪmˈpruːv/ (AmE)\n\n1. [verb] Improve: To make something better or enhance its quality.\n- 中文释义：使某事物变得更好或提高其质量。\n\n2. [verb] Progress: To develop or become better over time.\n- 中文释义：随着时间的推移发展或变得更好。\n\n例句：\n- She worked hard to improve her writing skills. （她努力提高自己的写作能力。）\n- The company is trying to improve customer satisfaction. （公司正在努力提高客户满意度。）"
      },
      {
        "word": "involve",
        "definition": "/ɪnˈvɒlv/ (BrE) /ɪnˈvɑːlv/ (AmE)\n\n1. [verb] Involve: To include or require someone or something as a necessary part of an activity.\n- 中文释义：将某人或某事作为活动必要部分包括进来。\n\n2. [verb] Engage: To make someone participate in something.\n- 中文释义：使某人参与某事。\n\n例句：\n- The project involves a lot of research and analysis. （这个项目涉及大量的研究和分析。）\n- He was involved in organizing the event. （他参与了活动的组织工作。）"
      },
      {
        "word": "justify",
        "definition": "/ˈdʒʌstɪfaɪ/ (BrE) /ˈdʒʌstɪfaɪ/ (AmE)\n\n1. [verb] Justify: To show or prove that something is right or reasonable.\n- 中文释义：表明或证明某事是正确的或合理的。\n\n2. [verb] Align: To adjust text so that it fits neatly within margins.\n- 中文释义：调整文本使其整齐地适应页边距。\n\n例句：\n- Can you justify your decision to the committee? （你能向委员会证明你的决定是合理的吗？）\n- Use the 'justify' option to align the text evenly. （使用“两端对齐”选项使文本均匀排列。）"
      },
      {
        "word": "knowledge",
        "definition": "/ˈnɒlɪdʒ/ (BrE) /ˈnɑːlɪdʒ/ (AmE)\n\n1. [noun] Knowledge: Information, understanding, or skill gained through experience or education.\n- 中文释义：通过经验或教育获得的信息、理解或技能。\n\n2. [noun] Awareness: Familiarity with a subject or situation.\n- 中文释义：对某一主题或情况的熟悉程度。\n\n例句：\n- Knowledge is power. （知识就是力量。）\n- His knowledge of history is impressive. （他对历史的了解令人印象深刻。）"
      },
      {
        "word": "maintain",
        "definition": "/meɪnˈteɪn/ (BrE) /meɪnˈteɪn/ (AmE)\n\n1. [verb] Maintain: To keep something in its original or desired state.\n- 中文释义：保持某事物处于原始状态或期望的状态。\n\n2. [verb] Support: To provide what is needed for something to continue.\n- 中文释义：为某事物的持续提供所需的支持。\n\n例句：\n- It's important to maintain a healthy lifestyle. （保持健康的生活方式很重要。）\n- The government aims to maintain economic stability. （政府的目标是维持经济稳定。）"
      },
      {
        "word": "negotiate",
        "definition": "/nɪˈɡəʊʃieɪt/ (BrE) /nɪˈɡoʊʃieɪt/ (AmE)\n\n1. [verb] Negotiate: To discuss or bargain in order to reach an agreement.\n- 中文释义：为了达成协议而讨论或谈判。\n\n2. [verb] Navigate: To successfully deal with a difficult situation.\n- 中文释义：成功应对困难局面。\n\n例句：\n- They are negotiating a new contract with their employees. （他们正在与员工谈判新合同。）\n- She negotiated the sharp turn on the road carefully. （她小心翼翼地驶过路上的急转弯。）"
      },
      {
        "word": "observe",
        "definition": "/əbˈzɜːv/ (BrE) /əbˈzɜːrv/ (AmE)\n\n1. [verb] Observe: To watch or notice something carefully.\n- 中文释义：仔细观察或注意到某事物。\n\n2. [verb] Celebrate: To acknowledge or honor a special occasion.\n- 中文释义：纪念或庆祝特殊场合。\n\n例句：\n- Scientists observe the behavior of animals in their natural habitat. （科学家观察动物在自然栖息地的行为。）\n- Many people observe traditional holidays with family gatherings. （许多人通过家庭聚会来庆祝传统节日。）"
      },
      {
        "word": "opportunity",
        "definition": "/ˌɒpəˈtjuːnəti/ (BrE) /ˌɑːpərˈtuːnəti/ (AmE)\n\n1. [noun] Opportunity: A favorable set of circumstances for doing something.\n- 中文释义：做某事的有利条件或时机。\n\n2. [noun] Chance: An occasion that allows something to be done.\n- 中文释义：允许做某事的机会。\n\n例句：\n- This job offers a great opportunity for career growth. （这份工作为职业发展提供了绝佳机会。）\n- Don't miss this opportunity to learn from the experts. （不要错过向专家学习的机会。）"
      },
      {
        "word": "participate",
        "definition": "/pɑːˈtɪsɪpeɪt/ (BrE) /pɑːrˈtɪsɪpeɪt/ (AmE)\n\n1. [verb] Participate: To take part in an activity or event.\n- 中文释义：参加某项活动或事件。\n\n2. [verb] Engage: To become involved in something actively.\n- 中文释义：积极投身于某事。\n\n例句：\n- Everyone is encouraged to participate in the discussion. （鼓励每个人参与讨论。）\n- She participated in the marathon last year. （她去年参加了马拉松比赛。）"
      },
      {
        "word": "promote",
        "definition": "/prəˈməʊt/ (BrE) /prəˈmoʊt/ (AmE)\n\n1. [verb] Promote: To support or encourage the development of something.\n- 中文释义：支持或促进某事物的发展。\n\n2. [verb] Advance: To move someone to a higher position or rank.\n- 中文释义：提升某人的职位或等级。\n\n例句：\n- The campaign aims to promote healthy eating habits. （这项活动旨在推广健康的饮食习惯。）\n- He was promoted to manager after five years of service. （他在服务五年后被提升为经理。）"
      },
      {
        "word": "recognize",
        "definition": "/ˈrekəɡnaɪz/ (BrE) /ˈrekəɡnaɪz/ (AmE)\n\n1. [verb] Recognize: To identify someone or something from previous encounters.\n- 中文释义：从之前的接触中识别某人或某物。\n\n2. [verb] Acknowledge: To accept or admit the existence or validity of something.\n- 中文释义：承认某事物的存在或有效性。\n\n例句：\n- I didn't recognize him at first because he had changed so much. （我一开始没认出他，因为他变化太大了。）\n- The government recognized the importance of renewable energy. （政府认识到可再生能源的重要性。）"
      },
      {
        "word": "require",
        "definition": "/rɪˈkwaɪə/ (BrE) /rɪˈkwaɪr/ (AmE)\n\n1. [verb] Require: To need something as a necessary part of a situation.\n- 中文释义：在某种情况下需要某事物作为必要部分。\n\n2. [verb] Demand: To insist on having or doing something.\n- 中文释义：坚持拥有或做某事。\n\n例句：\n- This recipe requires fresh ingredients. （这道食谱需要新鲜的食材。）\n- The law requires drivers to wear seat belts. （法律要求司机佩戴安全带。）"
      },
      {
        "word": "solution",
        "definition": "/səˈluːʃn/ (BrE) /səˈluːʃn/ (AmE)\n\n1. [noun] Solution: A way of solving a problem or dealing with a difficult situation.\n- 中文释义：解决问题或处理困难局面的方法。\n\n2. [noun] Mixture: A liquid containing dissolved substances.\n- 中文释义：含有溶解物质的液体。\n\n例句：\n- There is no easy solution to this complex issue. （这个复杂问题没有简单的解决办法。）\n- Add water to the powder to make a solution. （将水加入粉末中制成溶液。）"
      },
      {
        "word": "strategy",
        "definition": "/ˈstrætədʒi/ (BrE) /ˈstrætədʒi/ (AmE)\n\n1. [noun] Strategy: A plan of action designed to achieve a long-term goal.\n- 中文释义：为实现长期目标而设计的行动计划。\n\n2. [noun] Approach: A method or way of doing something.\n- 中文释义：做某事的方法或途径。\n\n例句：\n- The company developed a new marketing strategy. （公司制定了一项新的营销策略。）\n- Her strategy for success is to work hard and stay focused. （她成功的策略是努力工作并保持专注。）"
      },
      {
        "word": "support",
        "definition": "/səˈpɔːt/ (BrE) /səˈpɔːrt/ (AmE)\n\n1. [verb] Support: To give assistance or encouragement to someone or something.\n- 中文释义：给予某人或某事物帮助或鼓励。\n\n2. [noun] Aid: Help or resources provided to someone in need.\n- 中文释义：提供给有需要者的帮助或资源。\n\n例句：\n- She supported her friend during a difficult time. （她在困难时期支持了她的朋友。）\n- The charity provides financial support to low-income families. （该慈善机构为低收入家庭提供经济支持。）"
      },
      {
        "word": "understand",
        "definition": "/ˌʌndəˈstænd/ (BrE) /ˌʌndərˈstænd/ (AmE)\n\n1. [verb] Understand: To comprehend or grasp the meaning of something.\n- 中文释义：理解或掌握某事物的意义。\n\n2. [verb] Sympathize: To be aware of someone's feelings or problems.\n- 中文释义：意识到某人的感受或问题。\n\n例句：\n- I don't understand what you mean. （我不明白你的意思。）\n- He understands the challenges his students face. （他理解他的学生面临的挑战。）"
      }
    ]